Autodesk.Revit.DB.Plumbing.PipeFlowState
An enumerated type listing all the pipe flow states for a pipe

Autodesk.Revit.DB.Plumbing.PipeFlowState.TurbulentState
The flow state is Turbulent

Autodesk.Revit.DB.Plumbing.PipeFlowState.TransitionState
The flow state is Transition

Autodesk.Revit.DB.Plumbing.PipeFlowState.LaminarState
The flow state is Laminar

Autodesk.Revit.DB.Plumbing.PipeFlowState.MultiValues
The flow state has multi values